balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA008.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RTCVAL" edc:desc="" edc:impl="0xffff" edc:isindirect="true" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="RTCVAL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RTCVAL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RTCVAL" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RCFGCAL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="RCFGCAL" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CAL" edc:desc="" edc:mask="0xff" edc:name="CAL" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="RTCPTR" edc:desc="" edc:mask="0x3" edc:name="RTCPTR" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="RTCOE" edc:desc="" edc:mask="0x1" edc:name="RTCOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HALFSEC" edc:desc="" edc:mask="0x1" edc:name="HALFSEC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCSYNC" edc:desc="" edc:mask="0x1" edc:name="RTCSYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCWREN" edc:desc="" edc:mask="0x1" edc:name="RTCWREN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RTCEN" edc:desc="" edc:mask="0x1" edc:name="RTCEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CAL0" edc:desc="" edc:mask="0x1" edc:name="CAL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL1" edc:desc="" edc:mask="0x1" edc:name="CAL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL2" edc:desc="" edc:mask="0x1" edc:name="CAL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL3" edc:desc="" edc:mask="0x1" edc:name="CAL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL4" edc:desc="" edc:mask="0x1" edc:name="CAL4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL5" edc:desc="" edc:mask="0x1" edc:name="CAL5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL6" edc:desc="" edc:mask="0x1" edc:name="CAL6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CAL7" edc:desc="" edc:mask="0x1" edc:name="CAL7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCPTR0" edc:desc="" edc:mask="0x1" edc:name="RTCPTR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RTCPTR1" edc:desc="" edc:mask="0x1" edc:name="RTCPTR1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="n-ccnnnnrrnnnnnn" edc:cname="CMCON" edc:desc="" edc:impl="0xbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u-uuuuuuuuuuuuuu" edc:name="CMCON" edc:nzwidth="0x10" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1POS" edc:desc="" edc:mask="0x1" edc:name="C1POS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1NEG" edc:desc="" edc:mask="0x1" edc:name="C1NEG" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2POS" edc:desc="" edc:mask="0x1" edc:name="C2POS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2NEG" edc:desc="" edc:mask="0x1" edc:name="C2NEG" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1INV" edc:desc="" edc:mask="0x1" edc:name="C1INV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2INV" edc:desc="" edc:mask="0x1" edc:name="C2INV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUT" edc:desc="" edc:mask="0x1" edc:name="C1OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2OUT" edc:desc="" edc:mask="0x1" edc:name="C2OUT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1OUTEN" edc:desc="" edc:mask="0x1" edc:name="C1OUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2OUTEN" edc:desc="" edc:mask="0x1" edc:name="C2OUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1EN" edc:desc="" edc:mask="0x1" edc:name="C1EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2EN" edc:desc="" edc:mask="0x1" edc:name="C2EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1EVT" edc:desc="" edc:mask="0x1" edc:name="C1EVT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2EVT" edc:desc="" edc:mask="0x1" edc:name="C2EVT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMIDL" edc:desc="" edc:mask="0x1" edc:name="CMIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="CVRCON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------uuuuuuuu" edc:name="CVRCON" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CVR" edc:desc="" edc:mask="0xf" edc:name="CVR" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CVRSS" edc:desc="" edc:mask="0x1" edc:name="CVRSS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVRR" edc:desc="" edc:mask="0x1" edc:name="CVRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVROE" edc:desc="" edc:mask="0x1" edc:name="CVROE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVREN" edc:desc="" edc:mask="0x1" edc:name="CVREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CVR0" edc:desc="" edc:mask="0x1" edc:name="CVR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR1" edc:desc="" edc:mask="0x1" edc:name="CVR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR2" edc:desc="" edc:mask="0x1" edc:name="CVR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CVR3" edc:desc="" edc:mask="0x1" edc:name="CVR3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="--nrrrrrrr-nnnnn" edc:cname="CRCCON" edc:desc="" edc:impl="0x3fdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000001000000" edc:name="CRCCON" edc:nzwidth="0x10" edc:por="--00000001000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PLEN" edc:desc="" edc:mask="0xf" edc:name="PLEN" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="CRCGO" edc:desc="" edc:mask="0x1" edc:name="CRCGO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CRCMPT" edc:desc="" edc:mask="0x1" edc:name="CRCMPT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCFUL" edc:desc="" edc:mask="0x1" edc:name="CRCFUL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VWORD" edc:desc="" edc:mask="0x1f" edc:name="VWORD" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="CSIDL" edc:desc="" edc:mask="0x1" edc:name="CSIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PLEN0" edc:desc="" edc:mask="0x1" edc:name="PLEN0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLEN1" edc:desc="" edc:mask="0x1" edc:name="PLEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLEN2" edc:desc="" edc:mask="0x1" edc:name="PLEN2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLEN3" edc:desc="" edc:mask="0x1" edc:name="PLEN3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="VWORD0" edc:desc="" edc:mask="0x1" edc:name="VWORD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VWORD1" edc:desc="" edc:mask="0x1" edc:name="VWORD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VWORD2" edc:desc="" edc:mask="0x1" edc:name="VWORD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VWORD3" edc:desc="" edc:mask="0x1" edc:name="VWORD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VWORD4" edc:desc="" edc:mask="0x1" edc:name="VWORD4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:FreezeBit edc:freezeval="1" edc:name="CRC" edc:pos="0xe"/>
        </edc:SFRDef>
